"""
1. Користувач вводить два числа і один з математичних операторів +, -, *, /.
Виконайте відповідну математичну операцію. Зверніть увагу що ділення
на 0 породжує ексепшн, опрацюйте дану ситуацію будь-яким способом
"""
inp = input("Введіть два числа і один з математичних операторів +, -, *, / між ними: ")
while True:
    try:
        res = f"Результат виконання дії дорівнює: {eval(inp)}"
        break
    except ZeroDivisionError:
        res = "Є така думка, що на 0 ділити не можна, вибачте."
        break
    except SyntaxError:
        res = "Математичний оператор має бути між числами."
    except NameError:
        res = "Десь Ви ввели не число, мало бути схоже на приклад: 2+2."

print(res)
#  Перший спосіб занадто простий вийшов, додаю ще один варіант на всякий випадок:
qu = input("Бажаєте спробувати інший спосіб? y/n: ")
if qu == "y":
    inp_2 = input("Введіть два числа і один з математичних операторів +, -, *, /: ")
    print(inp_2)
elif qu == "n":
    pass
else:
    print("Очікується тільки y або n.")
